app/controllers/ventures_controller.rb

  def index
    @ventures = Venture.all
---
SELECT "ventures".* FROM "ventures"

  def destroy
    @venture.destroy
---
DELETE FROM "ventures" WHERE "ventures"."id" = $1  [["id", 1]]

    def set_venture
      @venture = Venture.find(params[:id])
---
SELECT  "ventures".* FROM "ventures" WHERE "ventures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]